#### Terragrunt Format and Style 🖌 `success`
#### Terragrunt Initialization ⚙️ `success`
#### Terragrunt Validation 🤖 `success`
#### Terragrunt Plan 📖 `success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01990d8535076ee5f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0780a48be021aadc9]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07dccc390788aacae]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0fe953e49b14a0806]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-051ec48c656f530c5]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09974787909fc4543]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-085d33ab48b1c6f5f]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-00f40336e299c5938]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0e8ab023f2606dede]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0afa447a91b808f9a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0780a48be021aadc91080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f3095047c9b97d05]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fcf725ffeab0e53d]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-07b5ed2a3432a7eb8]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-000b7a6a6a2201399]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a10ca6ab980927f0]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0edf9201f778b1599]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vpc.aws_route_table.public[0] has been changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0780a48be021aadc9"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-051ec48c656f530c5"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "demo-terragrunt-VPC-public"
        }
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "demo-terragrunt-VPC-eu-north-1a"
        }
      + tags_all             = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "demo-terragrunt"
          + "Environment"      = "Development"
          + "Name"             = "demo-terragrunt-VPC-eu-north-1a"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
      + vpc                  = true
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-07dccc390788aacae"
      + tags                 = {
          + "Name" = "demo-terragrunt-VPC-eu-north-1a"
        }
      + tags_all             = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "demo-terragrunt"
          + "Environment"      = "Development"
          + "Name"             = "demo-terragrunt-VPC-eu-north-1a"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-09974787909fc4543"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
Acquiring state lock. This may take a few moments...
aws_security_group.sg: Refreshing state... [id=sg-05031b84283938d5f]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...
Acquiring state lock. This may take a few moments...
aws_instance.this[0]: Refreshing state... [id=i-033a41cf20afe339c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.this[0] will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-033a41cf20afe339c"
      ~ instance_type                        = "t3.micro" -> "m5.xlarge"
        tags                                 = {
            "Name" = "demo-terragrunt-bastion-host"
        }
        # (28 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

Results for commit: fc85e92606bb94639c80fa1001246aa4925c2600

*Pusher: @bakavets, Action: `pull_request`, Working Directory: `dev`, Workflow: `Terragrunt CI/CD Pipeline`*